config/DataProcessors/УстановкаНаценок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>УстановкаНаценок</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

config/InformationRegisters/Наценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>Наценки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВариантНаценки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыНаценок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипДляЦО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДляЦО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЖНВЛС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бренд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Брэнды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубъектРФ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СубъектыРФ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/Catalogs/ВариантыНаценок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ВариантыНаценок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоСрокаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеСрокаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиПостроителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наценка_0_20</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наценка_20_100</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наценка_100_300</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наценка_300_500</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наценка_500_1000</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наценка_1000_5000</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наценка_5000</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/DataProcessors/УстановкаНаценок/Ext/ObjectModule.bsl
Процедура ОбновитьРегистрНаценок() Экспорт
	
	НаборЗаписей = РегистрыСведений.Наценки.СоздатьНаборЗаписей();
	
	Построитель = Новый ПостроительОтчета;
	Построитель.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АССОРТИМЕНТНЫЙ_ПЛАН.ЖНВЛС КАК ЖНВЛС,
	|	АССОРТИМЕНТНЫЙ_ПЛАН.ТипДляЦО КАК ТипДляЦО,
	|	АССОРТИМЕНТНЫЙ_ПЛАН.Бренд КАК Бренд,
	|	МестаХранения.СубъектРФ КАК СубъектРФ
	|ИЗ
	|	Справочник.АССОРТИМЕНТНЫЙ_ПЛАН КАК АССОРТИМЕНТНЫЙ_ПЛАН,
	|	Справочник.МестаХранения КАК МестаХранения
	|ГДЕ
	|	НЕ АССОРТИМЕНТНЫЙ_ПЛАН.ТипДляЦО ЕСТЬ NULL 
	|	И НЕ АССОРТИМЕНТНЫЙ_ПЛАН.ЖНВЛС ЕСТЬ NULL 
	|	И НЕ АССОРТИМЕНТНЫЙ_ПЛАН.Бренд ЕСТЬ NULL 
	|	И НЕ МестаХранения.СубъектРФ ЕСТЬ NULL";
	
	Построитель.ЗаполнитьНастройки();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВариантыНаценок.Ссылка КАК ВариантНаценки,
	|	ВариантыНаценок.НастройкиПостроителя,
	|	ВариантыНаценок.Код КАК Приоритет
	|ИЗ
	|	Справочник.ВариантыНаценок КАК ВариантыНаценок
	|ГДЕ
	|	ВариантыНаценок.НачалоСрокаДействия <= &ТекущаяДата
	|	И (ВариантыНаценок.ОкончаниеСрокаДействия >= &ТекущаяДата
	|			ИЛИ ВариантыНаценок.ОкончаниеСрокаДействия = ДАТАВРЕМЯ(1, 1, 1))
	|	И НЕ ВариантыНаценок.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
	
	Результат = Запрос.Выполнить();
	
	ВыборкаВариантыНаценки = Результат.Выбрать();
	
	Пока ВыборкаВариантыНаценки.Следующий() Цикл
		
		НастройкиПостроителя = ВыборкаВариантыНаценки.НастройкиПостроителя;
		
		Если СокрЛП(НастройкиПостроителя) <> "" Тогда
			Построитель.УстановитьНастройки(ЗначениеИзСтрокиВнутр(НастройкиПостроителя), Истина, Ложь, Ложь, Ложь, Ложь);		
		КонецЕсли;  		
		
		Построитель.Выполнить();
		Выборка = Построитель.Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаВариантыНаценки);
			
		КонецЦикла;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
